puppy_play_date/app/controllers/dogs_controller.rb

    def set_dog
      @dog = Dog.find(params[:id])
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = $1 LIMIT 1  [["id", 96]]