puppy_play_date/app/controllers/playdates_controller.rb

  def index
    render json: Playdate.all
---
SELECT "playdates".* FROM "playdates"

    def set_playdate
      @playdate = Playdate.find(params[:id])
---
SELECT  "playdates".* FROM "playdates" WHERE "playdates"."id" = $1 LIMIT 1  [["id", 4]]